samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    (void)iIndex;

    //
    // Device counts.
    //
    i32Idx = FindCGIParameter("din", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetDinDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }
    i32Idx = FindCGIParameter("relay", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        ConfigSetRelayDevices((uint8_t)ustrtoul(pcValue[i32Idx], 0, 10));
    }

    //
    // Per-input type bitmask ("types" = hex string, 2 chars per byte of 8
    // inputs; bit n of byte b = input b*8+n is pushbutton when set).
    //
    i32Idx = FindCGIParameter("types", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcT = pcValue[i32Idx];
        int iByte = 0;
        while((pcT[0] != '\0') && (pcT[1] != '\0') && (iByte < 15))
        {
            uint8_t ui8Val = (uint8_t)((HexNibble(pcT[0]) << 4) |
                                       HexNibble(pcT[1]));
            int iBit;
            for(iBit = 0; iBit < 8; iBit++)
            {
                ConfigSetInputPushbutton(iByte * 8 + iBit,
                                        (ui8Val & (1u << iBit)) != 0);
            }
            pcT += 2;
            iByte++;
        }
    }

    //
    // Per-input binding table: "binds" = 3 hex chars per slot, 4 slots per
    // input, for up to D*8 inputs.  12-bit encoding: output[6:0]|act[4:3]|trig[2:0].
    // "000" = unused slot.  (Parsing also stops at the end of the sent string.)
    //
    i32Idx = FindCGIParameter("binds", pcParam, i32NumParams);
    if(i32Idx != -1)
    {
        const char *pcB = pcValue[i32Idx];
        int iLen = (int)strlen(pcB);
        int iMaxIn = (int)ConfigGetDinDevices() * 8;
        int iInput, iSlot, iPos = 0;
        if(iMaxIn > CFG_MAX_INPUTS) { iMaxIn = CFG_MAX_INPUTS; }
        for(iInput = 0; (iInput < iMaxIn) && ((iPos + 2) < iLen); iInput++)
        {
            for(iSlot = 0; (iSlot < CFG_BIND_SLOTS) &&
                           ((iPos + 2) < iLen); iSlot++, iPos += 3)
            {
                uint16_t ui16V = (uint16_t)(((uint16_t)HexNibble(pcB[iPos]) << 8) |
                                            ((uint16_t)HexNibble(pcB[iPos+1]) << 4) |
                                             (uint16_t)HexNibble(pcB[iPos+2]));
                uint8_t ui8TrigAct = (uint8_t)(ui16V & 0x1Fu);
                uint8_t ui8Out     = (uint8_t)((ui16V >> 5) & 0x7Fu);
                if((ui8TrigAct & 0x07u) == 0)
                {
                    ui8TrigAct = 0;
                    ui8Out = BIND_OUTPUT_NONE;
                }
                ConfigBindingSet(iInput, iSlot, ui8TrigAct, ui8Out);
            }
        }
    }

    //
    // Persist all three records and request chain + discovery update.
    //
    ConfigSave();
    ConfigIOSave();
    ConfigBindingSave();
    g_bStartMQTT = true;
    g_bRepublishMQTT = true;

    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// This function is called by the HTTP server whenever it encounters an SSI
// tag in a web page.  The iIndex parameter provides the index of the tag in
// the g_pcConfigSSITags array. This function writes the substitution text
// into the pcInsert array, writing no more than iInsertLen characters.
//
//*****************************************************************************
//*****************************************************************************
//
// FwChunkCGIHandler - Receives one hex-encoded binary chunk of an OTA image.
//
// URL format (GET):
//   /fwchunk.cgi?seq=N&last=0&data=HEXHEX...
//
// seq=0 initialises the upload and erases the header page + first image page.
// Each subsequent request appends to the staging flash.
// last=1 flushes the alignment buffer, computes CRC32, writes the OTA header
// and EEPROM flag, then schedules a system reset.
//
// The hex-encoded payload carries up to ~494 binary bytes per request
// (limited by LWIP_HTTPD_MAX_URI_LEN = 1024).
//
//*****************************************************************************
static char *
FwChunkCGIHandler(int32_t iIndex, int32_t i32NumParams,
                  char *pcParam[], char *pcValue[])
{
    int32_t  iSeqIdx, iLastIdx, iDataIdx;
    int32_t  iSeqNum;
    bool     bLast;
    const char *pcData;
    uint32_t ui32DataHexLen, i;
    uint32_t ui32PageAddr;
    tOTAHeader sHdr;
    uint32_t ui32Crc;

    iSeqIdx  = FindCGIParameter("seq",  pcParam, i32NumParams);
    iLastIdx = FindCGIParameter("last", pcParam, i32NumParams);
    iDataIdx = FindCGIParameter("data", pcParam, i32NumParams);

    if(iSeqIdx < 0 || iDataIdx < 0)
    {
        return(DEFAULT_CGI_RESPONSE);
    }

    iSeqNum = (int32_t)ustrtoul(pcValue[iSeqIdx], NULL, 10);
    bLast   = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData  = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u; // must be even (pairs of hex chars)

    //
    // First chunk: reset state and pre-erase the header and first image page.
    //
    if(iSeqNum == 0)
    {
        g_ui32OTAWriteAddr    = OTA_IMAGE_ADDR;
        g_ui32OTASize         = 0;
        g_ui32OTAAlignLen     = 0;
        g_ui32OTALastErasedPage = OTA_IMAGE_ADDR;

        MAP_FlashErase(OTA_HEADER_ADDR);
        MAP_FlashErase(OTA_IMAGE_ADDR);

        UARTprintf("OTA: upload started.\n");
    }

    //
    // Decode hex bytes and write to staging flash in 4-byte aligned words.
    //
    for(i = 0; i < ui32DataHexLen; i += 2)
    {
        g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] =
            (uint8_t)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
        g_ui32OTASize++;

        if(g_ui32OTAAlignLen == 4)
        {
            //
            // Erase the next 16 KB page when the write pointer first enters it.
            //
            ui32PageAddr = g_ui32OTAWriteAddr & ~(0x4000u - 1u);
            if(ui32PageAddr > g_ui32OTALastErasedPage)
            {
                MAP_FlashErase(ui32PageAddr);
                g_ui32OTALastErasedPage = ui32PageAddr;
            }

            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }
    }

    //
    // Last chunk: flush any partial word (pad with 0xFF), then finalise.
    //
    if(bLast)
    {
        if(g_ui32OTAAlignLen > 0)
        {
            while(g_ui32OTAAlignLen < 4)
            {
                g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] = 0xFF;
            }
            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }

        //
        // CRC32 the staged image and write the header to 0x80000.
        //
        ui32Crc = ConfigCRC32((const uint8_t *)OTA_IMAGE_ADDR, g_ui32OTASize);

        sHdr.ui32Magic = OTA_HDR_MAGIC;
        sHdr.ui32Size  = g_ui32OTASize;
        sHdr.ui32CRC32 = ui32Crc;
        sHdr.ui32Rsvd  = 0;
        MAP_FlashProgram((uint32_t *)(uintptr_t)&sHdr,
                         OTA_HEADER_ADDR, sizeof(tOTAHeader));

        //
        // Set EEPROM pending flag so the next boot applies the update.
        //
        OtaSetPending(g_ui32OTASize);

        UARTprintf("OTA: %u bytes, CRC=0x%08x. Rebooting...\n",
                   g_ui32OTASize, ui32Crc);

        //
        // Signal the main loop to reset after the HTTP response is sent.
        //
        g_bOTAReset = true;
        return("/fwupdate_ok.shtml");
    }

    return("/tools.shtml");
}

//*****************************************************************************
//
// FactoryResetCGIHandler - Web-triggered factory reset.
//
// Invalidates all EEPROM records, then schedules a system reset via the same
// g_bOTAReset flag used by the OTA handler so the HTTP response is sent first.
//
//*****************************************************************************
static char *
FactoryResetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                       char *pcParam[], char *pcValue[])
{
    UARTprintf("Factory reset triggered via web UI.\n");
    MQTTAppStop();
    ConfigFactoryReset();
    g_bOTAReset = true;
    return("/factoryreset_ok.shtml");
}

//*****************************************************************************
//
// RebootCGIHandler - Graceful reboot from the web UI.
//
//*****************************************************************************
static char *
RebootCGIHandler(int32_t iIndex, int32_t i32NumParams,
                 char *pcParam[], char *pcValue[])
{
    UARTprintf("Reboot triggered via web UI.\n");
    MQTTAppStop();
    g_bOTAReset = true;
    return("/fwupdate_ok.shtml");
}

//*****************************************************************************
//
// UrlDecodeParam - decode a CGI parameter value that may contain + (space)
// or %XX sequences produced by JS encodeURIComponent / form encoding.
//
//*****************************************************************************
static void
UrlDecodeParam(const char *pcIn, char *pcOut, int iMax)
{
    int iIn = 0, iOut = 0;
    while(pcIn[iIn] && iOut < iMax - 1)
    {
        if(pcIn[iIn] == '+')
        {
            pcOut[iOut++] = ' ';
            iIn++;
        }
        else if(pcIn[iIn] == '%' && pcIn[iIn + 1] && pcIn[iIn + 2])
        {
            pcOut[iOut++] = (char)((HexNibble(pcIn[iIn + 1]) << 4) |
                                    HexNibble(pcIn[iIn + 2]));
            iIn += 3;
        }
        else
        {
            pcOut[iOut++] = pcIn[iIn++];
        }
    }
    pcOut[iOut] = '\0';
}

//*****************************************************************************
//
// NameSetCGIHandler - save a custom name for one input or output channel.
//
// URL: /nameset.cgi?type=in|out&idx=N&name=<URL-encoded string, max 11 chars>
//
//*****************************************************************************
static char *
NameSetCGIHandler(int32_t iIndex, int32_t i32NumParams,
                  char *pcParam[], char *pcValue[])
{
    int32_t iTypeIdx, iIdxIdx, iNameIdx;
    bool    bInput;
    int     iIdx;
    char    acName[CFG_NAME_LEN];

    iTypeIdx = FindCGIParameter("type", pcParam, i32NumParams);
    iIdxIdx  = FindCGIParameter("idx",  pcParam, i32NumParams);
    iNameIdx = FindCGIParameter("name", pcParam, i32NumParams);

