samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    if(iTypeIdx < 0 || iIdxIdx < 0 || iNameIdx < 0)
    {
        return(IOCFG_CGI_RESPONSE);
    }

    bInput = (pcValue[iTypeIdx][0] == 'i');
    iIdx   = (int)ustrtoul(pcValue[iIdxIdx], NULL, 10);
    UrlDecodeParam(pcValue[iNameIdx], acName, CFG_NAME_LEN);
    ConfigNameSet(bInput, iIdx, acName);
    UARTprintf("Name: %s[%d] = \"%s\"\n", bInput ? "in" : "out", iIdx, acName);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// CheckHWFactoryReset - Check SW1 (PJ0) at startup.
//
// If SW1 is held continuously for 5 seconds, all EEPROM records are
// invalidated and the device resets.  LED D1 (PN1) blinks as a countdown
// indicator.  Releasing SW1 at any point cancels the operation.
//
// Call after ConfigInit() (EEPROM must be initialised) but before the
// network stack starts.
//
//*****************************************************************************
static void
CheckHWFactoryReset(void)
{
    uint32_t ui32Count;

    //
    // Enable the GPIO ports used by SW1 (Port J) and LED D1 (Port N).
    // PinoutSet() may already have done this, but enabling twice is harmless.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOJ) ||
          !MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPION))
    {
    }

    //
    // PJ0 input with weak pull-up (SW1 is active-low).
    //
    MAP_GPIODirModeSet(GPIO_PORTJ_BASE, GPIO_PIN_0, GPIO_DIR_MODE_IN);
    MAP_GPIOPadConfigSet(GPIO_PORTJ_BASE, GPIO_PIN_0,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    //
    // PN1 output for LED D1 (active-high, off initially).
    //
    MAP_GPIODirModeSet(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_DIR_MODE_OUT);
    MAP_GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_1,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD);
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);

    //
    // Quick exit if SW1 is not held at boot.
    //
    if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
    {
        return;
    }

    UARTprintf("HW factory reset: keep SW1 held for 5s to confirm...\n");

    //
    // 500 x 10ms = 5 000ms countdown.  LED blinks every 500ms.
    //
    for(ui32Count = 0; ui32Count < 500; ui32Count++)
    {
        //
        // Toggle LED every 50 iterations (~500ms period).
        //
        MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,
                         ((ui32Count / 50) & 1) ? GPIO_PIN_1 : 0);

        MAP_SysCtlDelay(g_ui32SysClock / 300);   // ~10 ms at 120 MHz

        if(MAP_GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) != 0)
        {
            MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0);
            UARTprintf("HW factory reset: cancelled (SW1 released).\n");
            return;
        }
    }

    //
    // SW1 held for 5 seconds — perform factory reset.
    //
    MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1); // LED on solid
    UARTprintf("HW factory reset: erasing EEPROM...\n");
    MQTTAppStop();
    ConfigFactoryReset();
    UARTprintf("HW factory reset: rebooting...\n");
    MAP_SysCtlDelay(g_ui32SysClock / 3);
    MAP_SysCtlReset();
}

//*****************************************************************************
//
// NtpCfgCGIHandler - Save NTP server + TZ offset then restart SNTP.
//
//*****************************************************************************
static char *
NtpCfgCGIHandler(int32_t iIndex, int32_t i32NumParams,
                 char *pcParam[], char *pcValue[])
{
    int32_t iIdx;
    char    acServer[CFG_NTP_SERVER_LEN];
    int32_t i32Tz = 0;

    iIdx = FindCGIParameter("ntp", pcParam, i32NumParams);
    if(iIdx >= 0)
    {
        GetStringParam("ntp", pcParam, pcValue, i32NumParams,
                       acServer, CFG_NTP_SERVER_LEN);
        ConfigNtpSetServer(acServer);
    }

    iIdx = FindCGIParameter("tz", pcParam, i32NumParams);
    if(iIdx >= 0)
    {
        i32Tz = (int32_t)ustrtoul(pcValue[iIdx], NULL, 10);
        if(pcValue[iIdx][0] == '-') { i32Tz = -i32Tz; }
        if(i32Tz < -12) { i32Tz = -12; }
        if(i32Tz >  14) { i32Tz =  14; }
        ConfigNtpSetTz((int8_t)i32Tz);
    }

    ConfigNtpSave();
    SntpInit();
    UARTprintf("NTP: config updated, re-syncing.\n");
    return(DEFAULT_CGI_RESPONSE);
}

//*****************************************************************************
//
// CfgRestoreCGIHandler - Restore broker + NTP config from a JSON chunk stream.
//
// URL: /cfgrestore.cgi?seq=N&last=0|1&data=HEXHEX...
//
// Hex-decoded bytes accumulate in g_acCfgRestoreBuf.  On last=1 the buffer
// is parsed as JSON and the broker + NTP EEPROM records are updated.
//
//*****************************************************************************
#define CFG_RESTORE_BUF_SIZE 2048

static char    g_acCfgRestoreBuf[CFG_RESTORE_BUF_SIZE];
static uint32_t g_ui32CfgRestoreLen = 0;

//
// Minimal JSON value extractor using strstr.
//
// Skip JSON whitespace (space, tab, CR, LF).
#define SKIP_WS(p) while(*(p)==' '||*(p)=='\t'||*(p)=='\r'||*(p)=='\n'){(p)++;}

static bool
CfgJsonGetStr(const char *pcJson, const char *pcKey,
              char *pcVal, int iMax)
{
    char acSearch[48];
    const char *p;
    int i = 0;
    // Search for "key": — no trailing quote so it matches both "k":"v" and "k": "v"
    usnprintf(acSearch, sizeof(acSearch), "\"%s\":", pcKey);
    p = strstr(pcJson, acSearch);
    if(!p) { return(false); }
    p += ustrlen(acSearch);
    SKIP_WS(p);
    if(*p != '"') { return(false); }
    p++;  // skip opening quote
    while(*p && *p != '"' && i < iMax - 1) { pcVal[i++] = *p++; }
    pcVal[i] = '\0';
    return(true);
}

static int32_t
CfgJsonGetInt(const char *pcJson, const char *pcKey)
{
    char acSearch[48];
    const char *p;
    usnprintf(acSearch, sizeof(acSearch), "\"%s\":", pcKey);
    p = strstr(pcJson, acSearch);
    if(!p) { return(-1); }
    p += ustrlen(acSearch);
    SKIP_WS(p);
    if(*p == '-') { return(-(int32_t)ustrtoul(p + 1, NULL, 10)); }
    return((int32_t)ustrtoul(p, NULL, 10));
}

static char *
CfgRestoreCGIHandler(int32_t iIndex, int32_t i32NumParams,
                     char *pcParam[], char *pcValue[])
{
    int32_t iSeqIdx, iLastIdx, iDataIdx;
    bool    bLast;
    const char *pcData;
    uint32_t ui32DataHexLen, i;

    iSeqIdx  = FindCGIParameter("seq",  pcParam, i32NumParams);
    iLastIdx = FindCGIParameter("last", pcParam, i32NumParams);
    iDataIdx = FindCGIParameter("data", pcParam, i32NumParams);

    if(iSeqIdx < 0 || iDataIdx < 0) { return(DEFAULT_CGI_RESPONSE); }

    bLast  = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u;

    if(ustrtoul(pcValue[iSeqIdx], NULL, 10) == 0)
    {
        g_ui32CfgRestoreLen = 0;
    }

