samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    for(i = 0; i < ui32DataHexLen && g_ui32CfgRestoreLen < CFG_RESTORE_BUF_SIZE - 1u; i += 2)
    {
        g_acCfgRestoreBuf[g_ui32CfgRestoreLen++] =
            (char)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
    }

    if(!bLast) { return(DEFAULT_CGI_RESPONSE); }

    g_acCfgRestoreBuf[g_ui32CfgRestoreLen] = '\0';
    UARTprintf("CfgRestore: %u bytes JSON received.\n", g_ui32CfgRestoreLen);

    //
    // Parse and apply broker config.
    //
    {
        tMQTTConfig *psCfg = ConfigGet();
        char        acTmp[64];
        int32_t     i32Val;

        if(CfgJsonGetStr(g_acCfgRestoreBuf, "host", acTmp, CFG_HOST_LEN))
        { ustrncpy(psCfg->pcHost, acTmp, CFG_HOST_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "client", acTmp, CFG_CLIENTID_LEN))
        { ustrncpy(psCfg->pcClientID, acTmp, CFG_CLIENTID_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "user", acTmp, CFG_USER_LEN))
        { ustrncpy(psCfg->pcUser, acTmp, CFG_USER_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "pass", acTmp, CFG_PASS_LEN))
        { ustrncpy(psCfg->pcPass, acTmp, CFG_PASS_LEN - 1); }
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "topic", acTmp, CFG_TOPIC_LEN))
        { ustrncpy(psCfg->pcTopicBase, acTmp, CFG_TOPIC_LEN - 1); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "port");
        if(i32Val > 0 && i32Val <= 65535) { psCfg->ui16Port = (uint16_t)i32Val; }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "auth");
        if(i32Val >= 0) { psCfg->ui8UseAuth = (uint8_t)(i32Val != 0); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "din");
        if(i32Val >= 0) { ConfigSetDinDevices((uint8_t)i32Val); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "relay");
        if(i32Val >= 0) { ConfigSetRelayDevices((uint8_t)i32Val); }
        ConfigSave();
    }

    //
    // Parse and apply NTP config.
    //
    {
        char    acTmp[CFG_NTP_SERVER_LEN];
        int32_t i32Val;
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "ntp", acTmp, CFG_NTP_SERVER_LEN))
        { ConfigNtpSetServer(acTmp); }
        i32Val = CfgJsonGetInt(g_acCfgRestoreBuf, "tz");
        if(i32Val >= -12 && i32Val <= 14) { ConfigNtpSetTz((int8_t)i32Val); }
        ConfigNtpSave();
    }

    //
    // Restore per-input types (Switch / Pushbutton) from hex string.
    // Format: 2 hex chars per SN65HVS882 device (1 bit per input channel).
    //
    {
        char acTypes[64];
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "types", acTypes, sizeof(acTypes)))
        {
            const char *p = acTypes;
            int b, bit;
            for(b = 0; b < CFG_DIN_MAX_DEVICES && p[0] && p[1]; b++, p += 2)
            {
                uint8_t ui8Val = (uint8_t)((HexNibble(p[0]) << 4) |
                                            HexNibble(p[1]));
                for(bit = 0; bit < 8; bit++)
                {
                    ConfigSetInputPushbutton(b * 8 + bit,
                                             (ui8Val >> bit) & 1 ? true : false);
                }
            }
            ConfigIOSave();
            UARTprintf("CfgRestore: input types restored.\n");
        }
    }

    //
    // Restore input-to-relay bindings from hex string.
    // Format: 3 hex chars per slot, 4 slots per input, up to 16 inputs.
    // Encoding: bits 11:5 = output, bits 4:3 = action, bits 2:0 = trigger.
    //
    {
        char acBinds[256];
        if(CfgJsonGetStr(g_acCfgRestoreBuf, "binds", acBinds, sizeof(acBinds)))
        {
            const char *p    = acBinds;
            int         iLen = (int)ustrlen(acBinds);
            int         iIn, iSlot;
            int         iMaxIn = (int)ConfigGetDinDevices() * 8;
            if(iMaxIn > 16) { iMaxIn = 16; }
            for(iIn = 0; iIn < iMaxIn; iIn++)
            {
                for(iSlot = 0; iSlot < CFG_BIND_SLOTS; iSlot++)
                {
                    uint16_t v;
                    uint8_t  ui8TrigAct, ui8Out;
                    if((p - acBinds) + 3 > iLen) { goto done_binds; }
                    v = (uint16_t)(((uint16_t)HexNibble(p[0]) << 8) |
                                   ((uint16_t)HexNibble(p[1]) << 4) |
                                    (uint16_t)HexNibble(p[2]));
                    p += 3;
                    //
                    // Low 5 bits of v encode trig (2:0) and act (4:3),
                    // matching the ui8TrigAct field layout in tIOBindings.
                    //
                    ui8TrigAct = (uint8_t)(v & 0x1Fu);
                    ui8Out = ((v & 7u) == 0) ? BIND_OUTPUT_NONE
                                              : (uint8_t)((v >> 5) & 0x7Fu);
                    ConfigBindingSet(iIn, iSlot, ui8TrigAct, ui8Out);
                }
            }
            done_binds:
            ConfigBindingSave();
            UARTprintf("CfgRestore: bindings restored.\n");
        }
    }

    //
    // Restore channel names from packed 12-char-per-slot strings.
    // Trailing spaces are stripped; empty names are skipped (keep existing).
    //
    {
        char acPacked[256];
        int  iMax, i;

        if(CfgJsonGetStr(g_acCfgRestoreBuf, "innames", acPacked, sizeof(acPacked)))
        {
            iMax = (int)ConfigGetDinDevices() * 8;
            if(iMax > CFG_NAMES_MAX_INPUTS) { iMax = CFG_NAMES_MAX_INPUTS; }
            for(i = 0; i < iMax && (i + 1) * CFG_NAME_LEN <= (int)ustrlen(acPacked); i++)
            {
                char acName[CFG_NAME_LEN];
                int  k = CFG_NAME_LEN - 2;
                memcpy(acName, acPacked + i * CFG_NAME_LEN, CFG_NAME_LEN - 1);
                acName[CFG_NAME_LEN - 1] = '\0';
                while(k >= 0 && acName[k] == ' ') { acName[k--] = '\0'; }
                if(acName[0]) { ConfigNameSet(true, i, acName); }
            }
            UARTprintf("CfgRestore: input names restored.\n");
        }

        if(CfgJsonGetStr(g_acCfgRestoreBuf, "outnames", acPacked, sizeof(acPacked)))
        {
            iMax = (int)ConfigGetRelayDevices() * 8;
            if(iMax > CFG_NAMES_MAX_OUTPUTS) { iMax = CFG_NAMES_MAX_OUTPUTS; }
            for(i = 0; i < iMax && (i + 1) * CFG_NAME_LEN <= (int)ustrlen(acPacked); i++)
            {
                char acName[CFG_NAME_LEN];
                int  k = CFG_NAME_LEN - 2;
                memcpy(acName, acPacked + i * CFG_NAME_LEN, CFG_NAME_LEN - 1);
                acName[CFG_NAME_LEN - 1] = '\0';
                while(k >= 0 && acName[k] == ' ') { acName[k--] = '\0'; }
                if(acName[0]) { ConfigNameSet(false, i, acName); }
            }
            UARTprintf("CfgRestore: output names restored.\n");
        }
    }

    UARTprintf("CfgRestore: settings applied. Rebooting...\n");
    g_bOTAReset = true;
    return("/cfgrestore_ok.shtml");
}

//*****************************************************************************
//
// RelayPulseCGIHandler - Trigger a timed relay pulse from the web UI.
//
// URL: /relaypulse.cgi?relay=N&ms=D
//   relay = 0-based relay index
//   ms    = pulse duration in milliseconds (1..3 600 000)
//
//*****************************************************************************
static char *
RelayPulseCGIHandler(int32_t iIndex, int32_t i32NumParams,
                     char *pcParam[], char *pcValue[])
{
    int32_t  iRelayIdx, iMsIdx;
    uint32_t ui32Relay, ui32Ms;

