samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    iRelayIdx = FindCGIParameter("relay", pcParam, i32NumParams);
    iMsIdx    = FindCGIParameter("ms",    pcParam, i32NumParams);

    if(iRelayIdx < 0)
    {
        return(IOCFG_CGI_RESPONSE);
    }

    ui32Relay = ustrtoul(pcValue[iRelayIdx], NULL, 10);
    ui32Ms    = (iMsIdx >= 0) ? ustrtoul(pcValue[iMsIdx], NULL, 10) : 0;

    if(ui32Ms == 0)
    {
        ui32Ms = 1000;   // implicit default: missing/0 duration pulses for 1 s
    }

    if(ui32Ms > 3600000u || ui32Relay >= (uint32_t)RelayChainCount())
    {
        return(IOCFG_CGI_RESPONSE);
    }

    UARTprintf("Pulse: relay %u for %u ms (web UI)\n", ui32Relay, ui32Ms);
    RelayPulseStart((int)ui32Relay, ui32Ms);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// OutCfgCGIHandler - Save per-output modes, timed durations, and the shutter
// table.  Query parameters (all optional):
//   modes = one char per output, '1' = Timed, else Standard.
//   tmo   = comma-separated timed auto-OFF durations (ms), one per output.
//   sh    = "up:down:travel;up:down:travel;..." shutter definitions (rebuilds
//           the whole table; invalid pairs are skipped).
//
//*****************************************************************************
static char *
OutCfgCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                 char *pcValue[])
{
    int32_t idx;
    int     i, iSlot;

    (void)iIndex;

    //
    // Per-output mode.
    //
    idx = FindCGIParameter("modes", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        for(i = 0; (p[i] != '\0') && (i < CFG_MAX_OUTPUTS); i++)
        {
            ConfigSetOutMode(i, (p[i] == '1') ? OUT_MODE_TIMED
                                              : OUT_MODE_STANDARD);
        }
    }

    //
    // Per-output timed auto-OFF durations.
    //
    idx = FindCGIParameter("tmo", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        i = 0;
        while((*p != '\0') && (i < CFG_MAX_OUTPUTS))
        {
            uint32_t v = 0;
            while((*p >= '0') && (*p <= '9')) { v = (v * 10u) + (uint32_t)(*p - '0'); p++; }
            ConfigSetOutTimedMs(i, v ? v : 1000u);
            i++;
            if(*p == ',') { p++; } else { break; }
        }
    }

    //
    // Shutter table — always rebuilt from scratch.
    //
    for(iSlot = 0; iSlot < CFG_MAX_SHUTTERS; iSlot++)
    {
        ConfigShutterClear(iSlot);
    }
    idx = FindCGIParameter("sh", pcParam, i32NumParams);
    if(idx >= 0)
    {
        const char *p = pcValue[idx];
        iSlot = 0;
        while((*p != '\0') && (iSlot < CFG_MAX_SHUTTERS))
        {
            uint32_t up = 0, down = 0, travel = 0;
            while((*p >= '0') && (*p <= '9')) { up = (up * 10u) + (uint32_t)(*p - '0'); p++; }
            if(*p != ':') { break; }
            p++;
            while((*p >= '0') && (*p <= '9')) { down = (down * 10u) + (uint32_t)(*p - '0'); p++; }
            if(*p != ':') { break; }
            p++;
            while((*p >= '0') && (*p <= '9')) { travel = (travel * 10u) + (uint32_t)(*p - '0'); p++; }

            if((up != down) && (up < RelayChainCount()) && (down < RelayChainCount()))
            {
                ConfigShutterSet(iSlot, (uint8_t)up, (uint8_t)down,
                                 travel ? travel : 20000u);
                iSlot++;
            }
            if(*p == ';') { p++; } else { break; }
        }
    }

    ConfigOutputSave();
    OutputCtrlReload();
    g_bRepublishMQTT = true;   // refresh HA discovery (covers vs switches)
    UARTprintf("Output config saved via web UI.\n");
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
//
// CoverCGIHandler - Web UP/DOWN/STOP buttons for a shutter.
//   /cover.cgi?sh=N&cmd=up|down|stop
//
//*****************************************************************************
static char *
CoverCGIHandler(int32_t iIndex, int32_t i32NumParams, char *pcParam[],
                char *pcValue[])
{
    int32_t  iShIdx, iCmdIdx;
    uint32_t ui32Sh;
    tShCmd   eCmd;

    (void)iIndex;

    iShIdx  = FindCGIParameter("sh",  pcParam, i32NumParams);
    iCmdIdx = FindCGIParameter("cmd", pcParam, i32NumParams);
    if((iShIdx < 0) || (iCmdIdx < 0))
    {
        return(IOCFG_CGI_RESPONSE);
    }

    ui32Sh = ustrtoul(pcValue[iShIdx], NULL, 10);
    switch(pcValue[iCmdIdx][0])
    {
        case 'u': eCmd = SH_CMD_UP;     break;   // momentary: idle→open, moving→stop
        case 'd': eCmd = SH_CMD_DOWN;   break;   // momentary: idle→close, moving→stop
        case 's': eCmd = SH_CMD_STOP;   break;
        case 'c': eCmd = SH_CMD_TOGGLE; break;   // single-button cycle
        default:  return(IOCFG_CGI_RESPONSE);
    }

    UARTprintf("Cover: shutter %u cmd %d (web UI)\n", ui32Sh, (int)eCmd);
    OutputCtrlShutter((int)ui32Sh, eCmd);
    return(IOCFG_CGI_RESPONSE);
}

//*****************************************************************************
static int32_t
SSIHandler(int32_t iIndex, char *pcInsert, int32_t iInsertLen)
{
    tMQTTConfig *psCfg = ConfigGet();

    //
    // Which SSI tag have we been passed?  (The password is intentionally never
    // echoed back to the browser.)
    //
    switch(iIndex)
    {
        case SSI_INDEX_HOST:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcHost);
            break;

        case SSI_INDEX_PORT:
            usnprintf(pcInsert, iInsertLen, "%d", psCfg->ui16Port);
            break;

        case SSI_INDEX_CLIENT:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcClientID);
            break;

        case SSI_INDEX_USER:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcUser);
            break;

        case SSI_INDEX_TOPIC:
            usnprintf(pcInsert, iInsertLen, "%s", psCfg->pcTopicBase);
            break;

        case SSI_INDEX_DIN:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetDinDevices());
            break;

        case SSI_INDEX_RELAY:
            usnprintf(pcInsert, iInsertLen, "%d", ConfigGetRelayDevices());
            break;

        case SSI_INDEX_AUTH:
            usnprintf(pcInsert, iInsertLen, "%s",
                      psCfg->ui8UseAuth ? "checked" : "");
            break;

