samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
        case SSI_INDEX_OUTTMO:
        {
            //
            // Comma-separated timed auto-OFF durations (ms), one per output.
            //
            int n = (int)ConfigGetRelayDevices() * 8, i, iPos = 0;
            if(n > 16) { n = 16; }
            for(i = 0; i < n; i++)
            {
                char tmp[12];
                int  L;
                usnprintf(tmp, sizeof(tmp), "%u", ConfigOutTimedMs(i));
                L = (int)strlen(tmp);
                if((iPos + L + 2) >= iInsertLen) { break; }
                if(i > 0) { pcInsert[iPos++] = ','; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        case SSI_INDEX_SHUTTERS:
        {
            //
            // Configured shutters as "up:down:travel;" entries.
            //
            int i, iPos = 0;
            for(i = 0; i < CFG_MAX_SHUTTERS; i++)
            {
                uint8_t  up, down;
                uint32_t travel;
                char     tmp[24];
                int      L;
                if(!ConfigShutterGet(i, &up, &down, &travel)) { continue; }
                usnprintf(tmp, sizeof(tmp), "%d:%d:%u;", up, down, travel);
                L = (int)strlen(tmp);
                if((iPos + L) >= iInsertLen) { break; }
                memcpy(pcInsert + iPos, tmp, L);
                iPos += L;
            }
            pcInsert[iPos] = '\0';
            break;
        }

        default:
            usnprintf(pcInsert, iInsertLen, "??");
            break;
    }

    //
    // Tell the server how many characters our insert string contains.
    //
    return(strlen(pcInsert));
}

//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    //
    // Call the lwIP timer handler.
    //
    lwIPTimer(SYSTICKMS);

    //
    // Flag a periodic application tick for the main loop (MQTT keep-alive /
    // reconnect service).
    //
    g_bSysTickFlag = true;
}

//*****************************************************************************
//
// The interrupt handler for the timer used to pace the animation.
//
//*****************************************************************************
void
AnimTimerIntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    MAP_TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Indicate that a timer interrupt has occurred.
    //
    HWREGBITW(&g_ulFlags, FLAG_TICK) = 1;
}

//*****************************************************************************
//
// Display an lwIP type IP Address.
//
//*****************************************************************************
void
DisplayIPAddress(uint32_t ui32Addr)
{
    char pcBuf[16];

    //
    // Convert the IP Address into a string.
    //
    usprintf(pcBuf, "%d.%d.%d.%d", ui32Addr & 0xff, (ui32Addr >> 8) & 0xff,
            (ui32Addr >> 16) & 0xff, (ui32Addr >> 24) & 0xff);

    //
    // Display the string.
    //
    UARTprintf(pcBuf);
}

//*****************************************************************************
//
// Required by lwIP library to support any host-related timer functions.
//
//*****************************************************************************
void
lwIPHostTimerHandler(void)
{
    uint32_t ui32NewIPAddress;

    //
    // Get the current IP address.
    //
    ui32NewIPAddress = lwIPLocalIPAddrGet();

    //
    // See if the IP address has changed.
    //
    if(ui32NewIPAddress != g_ui32IPAddress)
    {
        //
        // See if there is an IP address assigned.
        //
        if(ui32NewIPAddress == 0xffffffff)
        {
            //
            // Indicate that there is no link.
            //
            UARTprintf("Waiting for link.\n");
        }
        else if(ui32NewIPAddress == 0)
        {
            //
            // There is no IP address, so indicate that the DHCP process is
            // running.
            //
            UARTprintf("Waiting for IP address.\n");
        }
        else
        {
            //
            // Display the new IP address.
            //
            UARTprintf("IP Address: ");
            DisplayIPAddress(ui32NewIPAddress);
            UARTprintf("\n");
            UARTprintf("Open a browser and enter the IP address.\n");

            //
            // We now have network connectivity: ask the main loop to bring up
            // the MQTT connection (if a broker has been configured).
            //
            g_bStartMQTT = true;
            SntpInit();
        }

        //
        // Save the new IP address.
        //
        g_ui32IPAddress = ui32NewIPAddress;
    }

    //
    // If there is not an IP address.
    //
    if((ui32NewIPAddress == 0) || (ui32NewIPAddress == 0xffffffff))
    {
        //
        // Do nothing and keep waiting.
        //
    }
}

//*****************************************************************************
//
// Apply all binding slots for one input that match the given trigger event.
// Each matching slot sets a relay and publishes its new retained state.
//
//*****************************************************************************
static void
ApplyBindings(int iInput, uint8_t ui8Trig)
{
    int iSlot;

    for(iSlot = 0; iSlot < CFG_BIND_SLOTS; iSlot++)
    {
        uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
        uint8_t out = ConfigBindingGetOutput(iInput, iSlot);
        uint8_t trig = ta & 0x07u;
        uint8_t act  = (ta >> 3) & 0x03u;

        //
        // Skip slot if: trigger doesn't match, output is not configured, or
        // output index is out of range.  BIND_TRIG_CHANGE matches both
        // BIND_TRIG_LEVEL_ON and BIND_TRIG_LEVEL_OFF so it fires on any
        // state transition of a switch-type input.
        //
        if(out == BIND_OUTPUT_NONE || out >= (uint8_t)RelayChainCount())
        {
            continue;
        }
        if(trig != ui8Trig &&
           !(trig == BIND_TRIG_CHANGE &&
             (ui8Trig == BIND_TRIG_LEVEL_ON || ui8Trig == BIND_TRIG_LEVEL_OFF)))
        {
            continue;
        }

        //
        // Route through the output controller so the bound output's mode is
        // honored.  Standard sets the relay; Timed starts its auto-OFF; a
        // shutter member moves that member's direction on ON/Toggle (press again
        // while moving = stop), stops on OFF, and runs the single-button
        // up/stop/down cycle on Cycle.
        //
        {
            tOutCmd eCmd = (act == BIND_ACT_ON)     ? OUT_CMD_ON     :
                           (act == BIND_ACT_OFF)    ? OUT_CMD_OFF    :
                           (act == BIND_ACT_CYCLE)  ? OUT_CMD_CYCLE  : OUT_CMD_TOGGLE;
            UARTprintf("Bind: in%d trig%d -> out%d cmd%d\n",
                       iInput, ui8Trig, out, (int)eCmd);
            OutputCtrlCommand(out, eCmd);
        }
    }
}

//*****************************************************************************
//
// Predicate for the click detector: does this input have a double-click action?
// Only when it does must the detector wait out the double-click window before
// committing to "single".  Inputs with a single action but no double action
// fire immediately on release (see InputEventsSetDoubleQuery).
//
//*****************************************************************************
static bool
InputNeedsDouble(int iInput)
{
    int iSlot;

