samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    for(iSlot = 0; iSlot < CFG_BIND_SLOTS; iSlot++)
    {
        uint8_t ta  = ConfigBindingGetTrigAct(iInput, iSlot);
        uint8_t out = ConfigBindingGetOutput(iInput, iSlot);

        if(((ta & 0x07u) == BIND_TRIG_DOUBLE) && (out != BIND_OUTPUT_NONE))
        {
            return true;
        }
    }
    return false;
}

//*****************************************************************************
//
// Click-event callback: publish the HA event and apply any binding.
//
//*****************************************************************************
static void
IEClickCallback(int iInput, const char *pcEvt)
{
    uint8_t ui8Trig;

    MQTTAppPublishInputEvent(iInput, pcEvt);

    ui8Trig = (pcEvt[0] == 's') ? BIND_TRIG_SINGLE : BIND_TRIG_DOUBLE;
    ApplyBindings(iInput, ui8Trig);
}

//*****************************************************************************
//
// Poll the SN65HVS882 input chain and log any change over UART.  Called from
// the periodic application tick.  This is bring-up instrumentation - MQTT
// publishing of the inputs will hook in here next.
//
//*****************************************************************************
static void
DINChainScan(void)
{
    static uint8_t pui8Prev[DIN_MAX_BYTES];
    static bool bPrimed;
    uint8_t pui8Cur[DIN_MAX_BYTES];
    uint8_t ui8Bytes, i;

    ui8Bytes = DINChainRead(pui8Cur, sizeof(pui8Cur));
    if(ui8Bytes == 0)
    {
        return;
    }
    memcpy(g_pui8LiveInState, pui8Cur, ui8Bytes);

    //
    // Process each input.  Channel c of device d maps to bit (7-c) of byte d
    // and to input index d*8+c.
    //
    // Pushbutton inputs: feed the current level to the click-detector every
    // scan (the FSM needs a continuous level signal for debounce).
    //
    // Switch inputs: detect edges vs the previous scan and publish ON/OFF.
    // The first scan only primes the baseline; initial retained states are
    // published by the MQTT post-connect sequence.
    //
    for(i = 0; i < ui8Bytes; i++)
    {
        uint8_t ui8Diff = (uint8_t)(pui8Cur[i] ^ pui8Prev[i]);
        int iBit;

        for(iBit = 0; iBit < 8; iBit++)
        {
            //
            // LSB-first within each byte: input index d*8+b maps to bit b, to
            // match the live input matrix (SSI_INDEX_INSTATES) and the relay
            // side, and thus the physical channel labels.  (Previously this
            // walked bits MSB-first (0x80>>iBit), so a press on channel N was
            // scanned/bound as channel 7-N within its byte - inputs fired the
            // wrong bindings even though the matrix showed the right channel.)
            //
            uint8_t ui8Mask = (uint8_t)(1u << iBit);
            int iInput = (i * 8) + iBit;
            bool bActive = (pui8Cur[i] & ui8Mask) != 0;

            if(ConfigInputIsPushbutton(iInput))
            {
                InputEventsUpdate(iInput, bActive);
            }
            else if(bPrimed && (ui8Diff & ui8Mask))
            {
                UARTprintf("DIN in%d: %s\n", iInput, bActive ? "ON" : "OFF");
                MQTTAppPublishInput(iInput, bActive);
                ApplyBindings(iInput,
                              bActive ? BIND_TRIG_LEVEL_ON : BIND_TRIG_LEVEL_OFF);
            }
        }
        pui8Prev[i] = pui8Cur[i];
    }
    bPrimed = true;
}

//*****************************************************************************
//
// Log DRV8860 nFAULT transitions (overcurrent / over-temperature / open-load).
//
//*****************************************************************************
static void
RelayFaultScan(void)
{
    static bool bPrevFault;
    bool bFault = RelayChainFault();

    if(bFault != bPrevFault)
    {
        UARTprintf("Relay nFAULT %s\n", bFault ? "ASSERTED" : "cleared");
        bPrevFault = bFault;
    }
}

//*****************************************************************************
//
// This application uses the Ethernet controller and lwIP TCP/IP stack to
// implement a web-configurable MQTT node.  Broker parameters are set via an
// on-board web page; the control board's field I/O is exposed over MQTT.
//
//*****************************************************************************
int
main(void)

{
    uint32_t ui32User0, ui32User1;
    uint8_t pui8MACArray[8];

    //
    // Make sure the main oscillator is enabled because this is required by
    // the PHY.  The system must have a 25MHz crystal attached to the OSC
    // pins.  The SYSCTL_MOSC_HIGHFREQ parameter is used when the crystal
    // frequency is 10MHz or higher.
    //
    SysCtlMOSCConfigSet(SYSCTL_MOSC_HIGHFREQ);

    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_240), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(true, false);

    //
    // Configure debug port for internal use.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);

    //
    // Clear the terminal and print a banner.
    //
    UARTprintf("\033[2J\033[H");
    UARTprintf("TM4C1294 MQTT IO\n\n");

    //
    // Load persistent MQTT configuration from EEPROM.
    //
    ConfigInit();

    //
    // If a firmware update was staged before the last reset, validate it and
    // apply it now (OtaCheckAndApply calls OtaApply which never returns).
    //
    OtaCheckAndApply();

    //
    // Check if SW1 (PJ0) is held at boot for a hardware factory reset.
    // If held for 5 s, EEPROM is erased and the device resets.
    //
    CheckHWFactoryReset();

    //
    // Configure SysTick for a periodic interrupt.
    //
    MAP_SysTickPeriodSet(g_ui32SysClock / SYSTICKHZ);
    MAP_SysTickEnable();
    MAP_SysTickIntEnable();

    //
    // Configure the hardware MAC address for Ethernet Controller filtering of
    // incoming packets.  The MAC address will be stored in the non-volatile
    // USER0 and USER1 registers.
    //
    MAP_FlashUserGet(&ui32User0, &ui32User1);
    if((ui32User0 == 0xffffffff) || (ui32User1 == 0xffffffff))
    {
        //
        // Let the user know there is no MAC address
        //
        UARTprintf("No MAC programmed!\n");

        while(1)
        {
        }
    }

    //
    // Tell the user what we are doing just now.
    //
    UARTprintf("Waiting for IP.\n");

    //
    // Convert the 24/24 split MAC address from NV ram into a 32/16 split
    // MAC address needed to program the hardware registers, then program
    // the MAC address into the Ethernet Controller registers.
    //
    pui8MACArray[0] = ((ui32User0 >>  0) & 0xff);
    pui8MACArray[1] = ((ui32User0 >>  8) & 0xff);
    pui8MACArray[2] = ((ui32User0 >> 16) & 0xff);
    pui8MACArray[3] = ((ui32User1 >>  0) & 0xff);
    pui8MACArray[4] = ((ui32User1 >>  8) & 0xff);
    pui8MACArray[5] = ((ui32User1 >> 16) & 0xff);

    //
    // Initialize the lwIP library, using DHCP.
    //
    lwIPInit(g_ui32SysClock, pui8MACArray, 0, 0, 0, IPADDR_USE_DHCP);

    //
    // Set DHCP hostname so the router shows "TomArts_<ClientID>" instead of
    // the default TI MAC OUI lookup ("Texas Instruments").
    // The static buffer persists for the lifetime of the program; netif_list
    // points to the single netif added by lwIPInit().
    //
    {
        static char pcHostname[48];
        usnprintf(pcHostname, sizeof(pcHostname), "TomArts_%s",
                  ConfigGet()->pcClientID);
        netif_set_hostname(netif_list, pcHostname);
    }

    //
    // Setup the device locator service.
    //
    LocatorInit();
    LocatorMACAddrSet(pui8MACArray);
    LocatorAppTitleSet("EK-TM4C1294XL MQTT IO");

    //
    // Initialize a sample httpd server.
    //
    httpd_init();

    //
    // Set the interrupt priorities.  We set the SysTick interrupt to a higher
    // priority than the Ethernet interrupt to ensure that the file system
    // tick is processed if SysTick occurs while the Ethernet handler is being
    // processed.  This is very likely since all the TCP/IP and HTTP work is
    // done in the context of the Ethernet interrupt.
    //
    MAP_IntPrioritySet(INT_EMAC0, ETHERNET_INT_PRIORITY);
    MAP_IntPrioritySet(FAULT_SYSTICK, SYSTICK_INT_PRIORITY);

    //
    // Pass our tag information to the HTTP server.
    //
    http_set_ssi_handler((tSSIHandler)SSIHandler, g_pcConfigSSITags,
            NUM_CONFIG_SSI_TAGS);

    //
    // Pass our CGI handlers to the HTTP server.
    //
    http_set_cgi_handlers(g_psConfigCGIURIs, NUM_CONFIG_CGI_URIS);

    //
    // Initialize IO controls (legacy web-demo LED / animation timer).
    //
    io_init();

    //
    // Initialize the field-I/O chains with the configured device counts.  The
    // relay chain powers up with all relays off and outputs enabled.
    //
    DINChainInit(ConfigGetDinDevices());
    RelayChainInit(ConfigGetRelayDevices());
    OutputCtrlReload();   // load per-output modes + shutter table
    UARTprintf("IO: %d input dev, %d relay dev.\n", ConfigGetDinDevices(),
               ConfigGetRelayDevices());

    //
    // Initialize the MQTT client subsystem (MAC seeds the HA device id).
    //
    MQTTAppInit(pui8MACArray);

    //
    // Wire the pushbutton click callback to the MQTT event publisher.
    //
    InputEventsSetCallback(IEClickCallback);
    InputEventsSetDoubleQuery(InputNeedsDouble);

    //
    // Main loop.  Networking (lwIP, httpd, MQTT receive) runs in interrupt
    // context; here we service the periodic application tick: apply pending
    // (re)connect requests and drive the MQTT keep-alive/reconnect timers.
    //
    while(1)
    {
        //
        // If the OTA last-chunk handler requested a reset, wait one tick so
        // the HTTP response is delivered, then reset into the new firmware.
        //
        if(g_bOTAReset)
        {
            g_bOTAReset = false;
            MAP_SysCtlDelay(g_ui32SysClock / 3);  // ~333 ms — let TCP flush
            MAP_SysCtlReset();
        }

        //
        // Wait for the next SysTick (~10 ms) application tick.
        //
        while(!g_bSysTickFlag)
        {
        }
        g_bSysTickFlag = false;

        //
        // Apply a pending (re)connect request from DHCP completion or a web
        // configuration change.
        //
        if(g_bStartMQTT)
        {
            g_bStartMQTT = false;
            //
            // A config change may also have altered the device counts.  Only
            // reconfigure the relay chain when its count actually changed, so an
            // unrelated setting change does not switch the relays off.
            //
            DINChainSetDevices(ConfigGetDinDevices());
            if(RelayChainGetDevices() != ConfigGetRelayDevices())
            {
                RelayChainSetDevices(ConfigGetRelayDevices());
            }
            OutputCtrlReload();   // pick up any output-mode / shutter changes
            MQTTAppStart();
        }

        //
        // Re-publish HA discovery after an I/O configuration change (without
        // a full reconnect — the broker session stays live).
        //
        if(g_bRepublishMQTT)
        {
            g_bRepublishMQTT = false;
            MQTTAppRepublish();
        }

        //
        // Poll the input chain and the relay fault line; log any transitions.
        //
        DINChainScan();
        RelayFaultScan();

        //
        // Advance pushbutton click-detection timers.
        //
        InputEventsTick(SYSTICKMS);
        RelayPulseTick(SYSTICKMS);
        OutputCtrlTick(SYSTICKMS);
        SntpTick(SYSTICKMS);

        //
        // Service MQTT keep-alive, reconnect timers and the post-connect
        // publish sequence.
        //
        MQTTAppTick(SYSTICKMS);
    }
}
